Revit 2023 API
Document.Export Method (String, String, OBJExportOptions)
 Exports a view specified in the export options to the OBJ format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2023
Syntax
C#
public bool Export(
	string folder,
	string name,
	OBJExportOptions options
)
Visual Basic
Public Function Export ( _
	folder As String, _
	name As String, _
	options As OBJExportOptions _
) As Boolean
Visual C++
public:
bool Export(
	String^ folder,
	String^ name,
	OBJExportOptions^ options
)
Parameters
folder
Type: System.String
 Output folder into which the file will be exported. The folder must exist.
name
Type: System.String
 Indicates the name of the OBJ file to export. If it doesn't end with ".obj", this extension will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options
Type: Autodesk.Revit.DB.OBJExportOptions
 Various options applicable to the OBJ format.
Return Value
 True if successful, otherwise False.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  NullOrEmpty -or- Contains invalid characters. -or- The provided options are not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
Autodesk.Revit.Exceptions.InvalidOperationException |  Export is temporarily disabled. -or- Exporting is not allowed in the current application mode.
Autodesk.Revit.Exceptions.InvalidPathArgumentException |  The folder does not exist.
Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException |  The ShapeExporter functionality is not available in the installed Revit.
See Also
Document Class
Export Overload
Autodesk.Revit.DB Namespace